tap "derailed/k9s"
brew "cocoapods"
brew "libpq"
brew "composer"
brew "elixir"
brew "fastlane"
brew "gh"
brew "git"
brew "imagemagick"
brew "mise"
brew "nvm"
brew "openjdk@17"
brew "pipx"
brew "pnpm"
brew "poetry"
brew "pyenv"
brew "pyenv-virtualenv"
brew "python@3.11"
brew "rbenv"
brew "redis"
brew "tree"
brew "whisper-cpp"
brew "derailed/k9s/k9s"
cask "android-studio"
cask "codex"
cask "modern-csv"
cask "orbstack"
cask "whispering"
cask "wkhtmltopdf"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onelight"
vscode "alexdauenhauer.catppuccin-noctis"
vscode "atomiks.moonlight"
vscode "atommaterial.a-file-icon-vscode"
vscode "azemoh.one-monokai"
vscode "barrsan.reui"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "daltonmenezes.aura-theme"
vscode "dbaeumer.vscode-eslint"
vscode "devzhaoyou.better-one-dark-vivid-theme"
vscode "dline.cobaltnext"
vscode "docker.docker"
vscode "dracula-theme-pro.theme-dracula-pro"
vscode "dubesoftware.github-dark-turbo"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "erik-rosengren.dark-candy"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.code-runner"
vscode "gabrielbatista.davinci"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "guilhermerodz.omni-owl"
vscode "hermitter.oh-lucy-vscode"
vscode "infeng.vscode-react-typescript"
vscode "janisdd.vscode-edit-csv"
vscode "kayteh.plastic-slate"
vscode "larxx.github-blue"
vscode "lucasmsa.arkham-theme"
vscode "marioterron.one-dark-bimbo"
vscode "markusylisiurunen.githubdarkmode"
vscode "marqu3s.aurora-x"
vscode "mayowapitan.true-dark-github-theme"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "miguelsolorio.min-theme"
vscode "mikemcbride.electron-highlighter"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mquandalle.graphql"
vscode "ms-python.autopep8"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "ms-vsliveshare.vsliveshare"
vscode "napthedevhcj.github-dark-plus"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "omthemes.omthemes"
vscode "onlylys.leaper"
vscode "phoenixframework.phoenix"
vscode "phplasma.csv-to-table"
vscode "ritwickdey.liveserver"
vscode "roman.ayu-next"
vscode "sainoba.px-to-rem"
vscode "siris01.ayu-green"
vscode "steoates.autoimport"
vscode "syler.sass-indented"
vscode "teabyii.ayu"
vscode "teriyaki.ashokai"
vscode "thang-nm.catppuccin-perfect-icons"
vscode "tobiasalthoff.atom-material-theme"
vscode "undersquire.perfect-github-theme"
vscode "wesbos.theme-cobalt2"
vscode "will-stone.plastic"
vscode "wscats.delete-node-modules"
npm "@anthropic-ai/claude-code"
npm "@fission-ai/openspec"
npm "corepack"
npm "eas-cli"

# ---- Daily-driver apps (added for the rebuild) ----
cask "ghostty"          # terminal
cask "zed"              # editor
cask "helium-browser"   # Helium browser (privacy browser). If you meant the PiP player, use: cask "helium"
cask "notion"
cask "slack"
cask "spotify"
cask "steam"
cask "granola"          # meeting notes
# orbstack + codex already captured above from the live brew state
